use YGGL
go

truncate table Employees


INSERT INTO Employees VALUES('000001','王林','大专','1966-01-23',1,8,'中山路32-1-508','83355668','2')
INSERT INTO Employees VALUES('020018','李丽','大专','1960-07-30',0,6,'中山东路102-2','83413301','1')
INSERT INTO Employees VALUES('108991','钟敏','硕士','1979-08-10',0,4,'中山路10-3-105','83346722','3')
INSERT INTO Employees VALUES('504209','陈林琳','大专','1969-09-03',0,5,'汉中路120-4-12','84468158','4')
INSERT INTO Employees VALUES('010008','伍容华','本科','1976-03-28',1,3,'北京东路100-2','83321321','1')
INSERT INTO Employees VALUES('020010','王向容','硕士','1982-12-09',1,2,'四牌楼10-0-108','83792361','1')
INSERT INTO Employees VALUES('102201','刘明','本科','1972-10-18',1,3,'虎踞路100-2','83606608','5')
INSERT INTO Employees VALUES('102208','朱俊','硕士','1965-09-28',1,2,'牌楼巷5-3-106','84708817','5')
INSERT INTO Employees VALUES('111006','张石兵','本科','1974-10-01',1,1,'解放路34-1-203','84563418','5')
INSERT INTO Employees VALUES('210678','林涛','大专','1977-04-02',1,2,'中山北路24-35','83467336','3')
INSERT INTO Employees VALUES('302566','李玉珉','本科','1968-09-20',1,3,'热和路209-3','58765991','4')
INSERT INTO Employees VALUES('308759','叶凡','本科','1978-11-18',1,2,'北京西路3-7-52','83308901','4')
go
