% 大学数学实验  p.25-27  2.2.1 例2   一年生植物的繁殖
% 大学数学实验2  p.29-30  2.2.4  一年生植物的繁殖
% 设一棵植物平均产种数为 c, 种子能够活过冬天的比例为 b, 
% 活过冬天的那些种子在来年春季发芽的比例为 a1，
% 未能发芽的那些种子又活过一个冬天的比例仍为 b, 在下
% 一年春季发芽的比例为 a2，
% 对初始数量x0, 种子能够活过冬天的比例b，返回n年后的数量
% 以 b = 0.18, 0.19, 0.20，初始数量 x0 = 100代入，作图
k = (0:20)';
y1 = ex223f(100,21,0.18);	% 给定x0, n, b, 调用ex223f
y2 = ex223f(100,21,0.19);
y3 = ex223f(100,21,0.20);
round([k, y1', y2', y3'])	% 显示4舍5入取整后的数据
plot(k,y1,k,y2,':',k,y3,'--'),	% 将3条线画在一张图上(p.27图2.4)
set(gcf,'color',[1 .953 .839])	
gtext('b = 0.18','fontsize',12)
gtext('b = 0.19','fontsize',12)
gtext('b = 0.20','fontsize',12)


yy1 = ex223f2(100,21,0.18);	% 给定x0, n, b, 调用ex223f
yy2 = ex223f2(100,21,0.19);
yy3 = ex223f2(100,21,0.20);