% 大学数学实验  p.59-60  教材例2(3)  用几种公式在区间 [ 0, pi/4 ] 上计算 1/(1 - sin (x) ) 的积分，
% 精确值     z = sqrt(2) = 1.41421356237310
% n = 100 时                      
% 矩形公式L   结果 z1 = 1.40477019726860,  z1 - z = -9.4434e-003  (公式p.57(3.20L))
% 矩形公式R   结果 z2 = 1.42373138624797,  z2 - z = 9.5178e-003  (公式p.57(3.20R))
% 梯形公式     结果 z3 = 1.41425079175829,  z3 - z = 3.7229e-005  (函数trapz)
% 梯形公式     结果 z4 = 1.41425079175829,  z4 - z = 3.7229e-005  (公式p.55(3.20))
% 辛普森公式 结果 z5 = 1.41421356566136,  z5 - z = 3.2883e-009  (公式p.55(3.22))
% 将 [ 0, pi/4 ] 100等分
format long	% 以下结果显示为双精度格式
n = 100;
h = pi/4/n;		% h = pi/4n = pi/400		
z = sqrt(2)
x = 0 : h : pi/4;	
y = 1./(1 - sin(x));

nn = length(y); 	% nn = n+1

z1 = sum(y(1:n))* h		% 用p.55 (3.19)矩梯形公式L直接计算
z1_z = z1 - z
z2 = sum(y(2:nn)) * h		% 用p.55 (3.19)矩梯形公式R直接计算
z2_z = z2 - z

z3 = trapz(y) * h		% 用梯形公式 函数计算
z3_z = z3 - z

z4 = (sum(y) - (y(1) + y(nn))/2 )* h	% 用p.55 (3.20)梯形公式直接计算
z4_z = z4 - z

z4_z3 = z4 -z3

n1 = 2: 2 : n;	% 对应第1, 3, ..., 99点
n2 = 3: 2 : n;	% 对应第2, 4, ..., 98点	
z5 = ( y(1)+y(nn)+4*sum(y(n1)) +2*sum(y(n2)) )* h/3	% 用p.55 (3.22)辛普森公式直接计算
z5_z = z5 - z

format short