% 大学数学实验2  p.63-64  教材例4  数值计算有瑕点的广义积分： 区间:[ 0, 1 ], f(x) = exp(- x*x )
% 精度 eps0 = 1e-4
% 精确值 I = pi^2/12 = 0.82246703342411
% 辛普森公式(tol=1e-5)         z = 0.82254838503961，误差 = 8.135161549993608e-005 在1e-4内
% 辛普森公式(默认tol)        z1 = 0.82247094537944，误差 = 3.911955328228522e-006 在1e-4内
format long	% 以下结果显示为双精度格式
I = pi^2/12
eps0 = 1e-4;	% 控制的精度值
r = 1e-7;
Ir = r * ( - log(r) + 1)	% Ir = 1.7118e-006 < 1e-5
eps1 = eps0/10
z = quad('- log(x)./(1+x)', r, 1, eps1)  	%辛普森公式, 误差限 1e-5 
z_I = z - I		% 近似计算的误差

z1 = quad('- log(x)./(1+x)', r, 1)  	%辛普森公式, 误差限为默认的 1e-6 
z1_I = z1 - I		% 近似计算的误差

format short