% 大学数学实验2  p.130-135      离散形式的阻滞增长模型(Logistic模型)  分岔与混沌现象  

% 大学数学实验  p.35-38      2.4.1 例6  离散形式的阻滞增长模型(Logistic模型)  
% 大学数学实验  p.129-131  6.4           分岔与混沌现象  

% x.k ~ 某种群第 k 代的数量 :x.k+1 – x.k = r ( 1 – x.k/N ) x.k   
% 原设 N = 1，取 r = 0.3, 1.8, 2.5,  初值 x0 = 0.1  
% 现设 N = 1，r 取 8个值,  初值 x0 = 0.1 ，1.001
clear
r = [ 0.3, 1.8, 2.2, 2.5, 2.55, 2.7, 2.7      2.83 ];
x = [0.1, 0.1, 0.1, 0.1, 0.1,   0.1, 0.1001, 0.1];	% 赋初值
n = 50;				% 迭代次数
k = (0:n)';
for i = 1:n
    x(i+1,:) = x(i,:) + r.* x(i,:).*(1 - x(i,:));	% 按p.35(2.48)p.130(6/45)式迭代计算
end

figure(1)             % 图6.8
for j = 1:6
     subplot(3,2,j),  	% 在一个图形窗内画六张图
      plot(k, x(:,j),'linewidth',2),  axis([0,50, 0, 1.5]),
      text( 20, 0.3, ['r = ',num2str(r(j),3)],'fontsize',14)
end

figure(2)             % 图6.10
for j = 6:7
     subplot(1,2,j-5),  	% 在一个图形窗内画2张图
      plot(k, x(:,j),'linewidth',2),  axis([0,50, 0, 1.5]),
      text( 20, 0.3, ['x0 = ',num2str(x(1,j),5)],'fontsize',14)
end
	
figure(3)     
j = 8
      plot(k, x(:,j),'linewidth',2),  axis([0,50, 0, 1.5]),
      text( 20, 0.3, ['r = ',num2str(r(j),3)],'fontsize',14)
     	
kx = [ k, x]		% 输出结果

