% 大学数学实验|2  p.149|152  例3 
% 拟合c( t ) = r e(–k t) 中的系数 r,  k 
% r -- x(1),  k -- x(2)
% 初值 [ 10, 0.5 ] 

x0 = [ 10, 0.5];
t = [ 0.25  0.5  1  1.5  2  3  4  6  8 ];
c = [ 19.21 18.15  15.36  14.10  12.89  9.32  7.45  5.24  3.01 ];

f1 = inline( 'x(1) * exp( -x(2) * t ) ', 'x',  't')
[x1, rnorm1, res1] = lsqcurvefit(f1, x0, t, c)

f2 = inline( 'x(1) * exp( -x(2) * t ) - c', 'x',  't', 'c')
[x2, rnorm2, res2] = lsqnonlin(f2, x0,[], [], [], t, c)
%结果：
% x1 =   20.2413    0.2420
% rnorm1 =     1.0659
% res1 =   -0.1568   -0.2152    0.5311   -0.0198   -0.4143    0.4745     0.2394   -0.5006   -0.0889
%
% x2 =   20.2413    0.2420
% rnorm2 =     1.0659
% res2 =   -0.1568   -0.2152    0.5311   -0.0198   -0.4143    0.4745     0.2394   -0.5006   -0.0889
%

[x3, rnorm3, res3] = lsqcurvefit(@ex742f1, x0, t, c)

[x4, rnorm3, res3] = lsqnonlin(@ex742f2, x0, [], [], [], t, c)  %[]分别为下界、上界、选项

(x1-x2).^2 +(x1-x3).^2 +(x1-x4).^2 	%=0 表示所有x均相同