% 大学数学实验|2  p.171-172|177, p.189-193|189  实验8 实例3  供应与选址  
% -----------线性规划 -------------------------
%某公司有 6 个建筑工地，位置坐标为 (ai , bi ) (单位：公里), 
%水泥日用量 di (单位：：吨）
%1) 现有 2 料场，位于 A(5, 1), B(2, 7),
%    记 ( xj , yj ),  j = 1, 2, 日储量 ej 各有20 吨。 
%    假设：料场和工地之间有直线道路 
%    制定每天的供应计划，即从 A, B 两料场分别向各工地运送
%      多少吨水泥，使总的吨公里数最小
%
%   min  SUMij [cij [( xj  – ai )2 + ( yj  – bi )2 ]^1/2 ]
%   s.t.   SUMi [cij] = di;     SUMj [cij] <= ej
%  1) 12个变量cij             x(1) ~ x(12)


clear
format short

	% 位置1 :  ( xx(1,1), xx(1,2) ), 从位置1运出的数量 x(1:6) 
	% 位置2 :  ( xx(2,1), xx(2,2) ), 从位置2运出的数量 x(7:12)

a = [ 1.25   8.75   0.50    5.75   3.00   7.25 ];
b = [ 1.25   0.75   4.75    5.00   6.50   7.75 ];
d = [ 3      5      4       7      6      11 ]' ;
e = [ 20  20]' ;
	% A1 = [ 1 1 1 1 1 1 0 0 0 0 0 0 
	%        0 0 0 0 0 0 1 1 1 1 1 1 ]
A1 = [ ones(1,6), zeros(1, 6); zeros(1, 6), ones(1,6) ];
B1 = e;
	% A2 = [ 1 0 0 0 0 0 1 0 0 0 0 0  
	%        0 1 0 0 0 0 0 1 0 0 0 0 
	%        0 0 1 0 0 0 0 0 1 0 0 0 
	%        0 0 0 1 0 0 0 0 0 1 0 0 
	%        0 0 0 0 1 0 0 0 0 0 1 0 
	%        0 0 0 0 0 1 0 0 0 0 0 1  ]
A2 = [ eye(6), eye(6) ];
B2 = d;

xx = [ 5  1; 2  7 ]	%原料场位置
for i = 1:6
    c(i)   = sqrt( ( xx(1,1) - a(i))^2 + ( xx(1,2) - b(i) )^2 );
    c(i+6) = sqrt( ( xx(2,1) - a(i))^2 + ( xx(2,2) - b(i) )^2 );
end

v1 = zeros(1,12);	
[ x, z0, ef, out, lag ] = linprog(c, A1, B1, A2, B2, v1) 
[x(1:6)'; x(7:12)'], z = c*x

