% 大学数学实验2 p.177,202, p.212-214  实验9 实例2  选址问题
% 大学数学实验  p.171-172, p.189-193  实验8 实例3  供应与选址  
% -----------非线性规划 ------方法2-------------------
%某公司有 6 个建筑工地，位置坐标为 (ai , bi ) (单位：公里), 
%水泥日用量 di (单位：：吨）
%2) 改建两个新料场，需要确定新料场位置 ( xj , yj ) 和 
%       运量 cij，在其它条件不变下使总吨公里数最小。
%
%   min  SUMij [cij [( xj  – ai )2 + ( yj  – bi )2 ]1/2 ]
%   s.t.   SUMi [cij] = di;     SUMj [cij] <= ej
%  2) 16个变量cij, xi,yi   x(1) ~ x(12), x(13)~x(16)
%  改进方法10个变量 ci2 = di-ci1,xi,yj  ~  
clear
'========p.191~192|213========非线性方法2==='
format short
	% 位置1 :  ( x(7), x(8) ), 从位置1运出的数量  :  x(1:6) 
	% 位置2 :  ( x(9), x(10) ), 从位置2运出的数量: 需求 - x(1:6)

a = [ 1.25   8.75   0.50    5.75   3.00   7.25 ];
b = [ 1.25   0.75   4.75    5.00   6.50   7.75 ];
d = [ 3        5        4         7        6        11 ]' ;
e = [ 20  20]' ;
	% A1 = [ 1 0 0 0 0 0 0 0 0 0 
	%            0 1 0 0 0 0 0 0 0 0 
	%            0 0 1 0 0 0 0 0 0 0 
	%            0 0 0 1 0 0 0 0 0 0
	%            0 0 0 0 1 0 0 0 0 0 
	%            0 0 0 0 0 1 0 0 0 0 
	%            1 1 1 1 1 1 0 0 0 0 
	%            -1 -1 -1 -1 -1 -1 0 0 0 0 ]
A10 = [ eye(6); ones(1,6); -1*ones(1,6) ];
A1 = [ A10, zeros(8,4) ];
B1 = [ d; e(1); e(2) - sum(d) ];
x0 = [ zeros(1, 6), 5 1 2 7 ];	% 取原料场位置为新料场位置的初值
v1 = zeros(1,10);	
v2 = [ d', [ 10 10 10 ,10] ];	
opt = optimset('Largescale', 'off','MaxIter', 100, 'Maxfun', 4000);	
[x, fv, ef, out ] =  fmincon( @ex934cf, x0, A1, B1, [], [], v1, v2, [], opt )
%fv =   89.8835
x0 = [ ones(1, 6), 5 1 2 7 ];
[x, fv, ef, out ] =  fmincon( @ex934cf, x0, A1, B1, [], [], v1, v2, [], opt )
%fv =   89.8835
x0 = [ 3*rand(1, 6), 5 1 2 7 ];
[x, fv, ef, out ] =  fmincon( @ex934cf, x0, A1, B1, [], [], v1, v2, [], opt )
%fv =   85.2660      %2008a下运行多次才得此结果

 
plot (a,b, '+') 
text(a+0.1,b, num2str(d))
a1 = [x(7),x(9)]';
b1 = [x(8),x(10)]';
hold on
plot (a1,b1, 'ro') 
d1 = sum(x(1:6));
d1 = [d1; sum(d) - d1];
text (a1-0.15,b1-0.25, num2str(d1)) 
hold off