function [ f, g, H ] = ex0804fun(x)
% 大学数学实验2 p.209  实验9 例2  求解非线性规划 
% 大学数学实验  p.185  实验8 例4  求解非线性规划
% min z = e^x1( 4x1^2 + 2x2^2 + 4x1x2 + 2x2 + 1 )  
% s.t.  x1x2 – x1 – x2 + 1.5 <= 0,  x1x2 + 10 >= 0  
%        x1^2 + x2 – 1 = 0

f = exp(x(1)) * ( 4*x(1)^2 + 2*x(2)^2 + 4*x(1)*x(2) + 2*x(2) + 1 ) ;
if  nargout  >  1
    g(1) = exp(x(1)) * ( 4*x(1)^2 + 2*x(2)^2 + 4*x(1)*x(2) + 8*x(1) + 6*x(2) + 1 );
    g(2) = exp(x(1)) * ( 4*x(1) + 4*x(2) + 2 );
end
if  nargout  >  2	% 本例不能使用大规模算法，因此以下输入的黑塞矩阵不会被使用
    H = exp(x(1)) * [ 4*x(1)^2 + 2*x(2)^2 + 4*x(1)*x(2) + 16*x(1) + 10*x(2) + 9,  4*x(1) + 4*x(1) + 6;  
                                4*x(1) + 4*x(1) + 6, 4 ];
end

