% 大学数学实验2p.255 实验11 例1, 银行的柜台高度问题
clear all; clc; clf;		%清除所有变量，清命令窗口，关图形窗口
X =[100 110 136 97 104 100 95 120 119 99 ...   % 输入表2数据，...为延续符号
126 113 115 108 93 116 102 122 121 122 ...
118 117 114 106 110 119 127 119 125 119 ...
105 95 117 109 140 121 122 131 108 120 ...
115 112 130 116 119 134 124 128 115 110];
[N,Y]=hist(X)	% 频数表
hist(X)		% 直方图
x1=mean(X) 	% 各个统计量:均值,中位数,极差,标准差,偏度,峰度
x2=median(X) 	
x3=range(X)
x4=std(X)
x5=skewness(X)
x6=kurtosis(X)


% PPT  p.25
XX = 95:5:140;
[N,Y]=hist(X,XX)
% hist(X,XX),pause            % 频数直方图
NY=N/50/(Y(2)-Y(1));          % 频数/样本容量/bar宽 = 频率直方图的高度
bar(Y,NY,1)		      % 频率直方图
axis([92.5 142.5 0 0.055])
% 添加正态拟合线
xx = [90:145]';
yy = normpdf(xx,x1,x4);
hold on 
plot(xx,yy,'k','linewidth',2)
hold off

%示例
%exam1001a.m
%输出图和下列结果：
%N = 4 4 3 6 8 12 5 4 2 2
%Y= 95.3500 100.0500 104.7500 109.4500 114.1500 118.8500 123.5500
%128.2500 132.9500 137.6500
%x1 = 115.2600，x2 =116.5000
%x3 =47，x4 =10.9690
%x5 = -0.0971，x6 =2.6216
